app/Controllers/Admin.php

    public function index(){
        $userlogin=user()->username;
        $data['title']=" admin";
        // $users = new \Myth\Auth\Models\UserModel();
        // $data['users']= $users->findAll();

        $this->builder->select('users.id as userid ,username,email,name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('users.id',$userlogin);
        $query = $this->builder->get();
---
SELECT `users`.`id` as `userid`, `username`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = 'admin'